SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DuewagC_Koeln_3764-Sonderzug
	Comment (
		Created with EngMexx V1.0.2

	)
	Type ( Engine )
	WagonShape ( "DuewagC_Koeln_3738.s" )
	Size ( 1m 5m 10.6m )
	CentreOfGravity ( 0m 2.25m 0m )
	Mass ( 10t )
	WheelRadius ( 0.35m )
	InertiaTensor ( Box ( 1m 5m 11m ) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 5E6N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			Break ( 2E7N 0N )
			r0 ( 15cm 1E9m )
		)
		CouplingHasRigidConnection (  )
		Velocity ( 0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1E7N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			r0 ( 0m 1E9m )
		)
		Centre ( 0.5m )
		Radius ( 1m )
		Angle ( 0.5deg )
	)
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 250kN )
	DerailBufferForce ( 200kN )
	NumWheels ( 2 )
	Friction (
		150N/m/s	1	-1mph	0N/m/s	1
		5.1N/rad/s	1	-1rad/s	0N/rad/s	1
	)
	BrakeEquipmentType ( "triple_valve,auxilary_reservoir,emergency_brake_reservoir" )
	BrakeSystemType ( Air_single_pipe )
	MaxBrakeForce ( 20kN )
	EmergencyBrakeResMaxPressure ( 110 )
	TripleValveRatio ( 2.5 )
	MaxReleaseRate ( 40 )
	MaxApplicationRate ( 40 )
	MaxAuxilaryChargingRate ( 35 )
	EmergencyResCapacity ( 10 )
	EmergencyResChargingRate ( 30 )
	BrakeCylinderPressureForMaxBrakeBrakeForce ( 70 )
	PassengerCapacity ( 30 )
	Lights ( 2
		Light (
			comment ( hinten links aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 3 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
				State (
					LightColour ( FFFF0000 )
					Position ( 0.81 0.92 -5.25 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
		Light (
			comment ( hinten rechts aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 3 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
				State (
					LightColour ( FFFF0000 )
					Position ( -0.85 0.92 -5.25 )
					Azimuth ( -180 -180 -180 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
	)
	Sound ( "Duewag_Eng.sms" )
)

Engine ( DuewagC_Koeln_3764-Sonderzug
	Wagon ( "DuewagC_Koeln_3764-Sonderzug" )
	Type ( Electric )
	MaxPower ( 100kW )
	MaxForce ( 12kN )
	MaxContinuousForce ( 10kN )
	MaxVelocity ( 65km/h )
	MaxCurrent ( 100A )
	WheelRadius ( 0.35m )
	Sanding ( 10km/h )
	NumWheels ( 1 )

	AirBrakesAirCompressorPowerRating ( 1 )
	AirBrakesAirCompressorWattage ( 19000 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 10 )
	AirBrakesCompressorRestartPressure ( 65 )
	AirBrakesHasLowPressureTest ( 1 )
	AirBrakesIsCompressorElectricOrMechanical ( 0 )
	AirBrakesMainMaxAirPressure ( 70 )
	AirBrakesMainMinResAirPressure ( 0 )
	AirBrakesMainResVolume ( 8 )
	EngineBrakesControllerMinPressureReduction ( 6 )
	EngineBrakesControllerMaxApplicationRate ( 20 )
	EngineBrakesControllerMaxReleaseRate ( 20 )
	EngineBrakesControllerEmergencyApplicationRate ( 50 )
	EngineBrakesControllerMinSystemPressure ( 0 )
	EngineBrakesControllerMaxSystemPressure ( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty ( 0 )
	EngineBrakesControllerFullServicePressureDrop ( 26 )
	EngineBrakesControllerDirectControlExponent ( 1 )
	EngineBrakesControllerHasProportionalBrake ( 1 )
	TrainBrakesControllerMinPressureReduction ( 6 )
	TrainBrakesControllerMaxApplicationRate ( 10 )
	TrainBrakesControllerMaxReleaseRate ( 4 )
	TrainBrakesControllerEmergencyApplicationRate ( 50 )
	TrainBrakesControllerMinSystemPressure ( 0 )
	TrainBrakesControllerMaxSystemPressure ( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty ( 0 )
	TrainBrakesControllerFullServicePressureDrop ( 26 )
	EngineBrakesProportionalBrakeLag ( 0.9 )

	DynamicBrakesMinUsableSpeed ( 1 )
	DynamicBrakesMaximumEffectiveSpeed ( 25 )
	DynamicBrakesMaximumForce ( 10kN )
	DynamicBrakesResistorCurrentLimit ( 200 )
	DynamicBrakesCutInSpeed ( 2 )
	DynamicBrakesMaxAirBrakePressure ( 15 )
	DynamicBrakesFadingSpeed ( 10 )
	DynamicBrakesDelayTimeBeforeEngaging ( 0 )
	DynamicBrakesMaximumSpeedForFadeOut ( 35 )
	DynamicBrakesEffectAtMaximumFadeOut ( 0 )
	DynamicBrakesHigherSpeedCurveExponent ( 1 )
	DynamicBrakesLowerSpeedCurveExponent ( 1 )
	DynamicBrakesNumberOfControllerNotches ( 0 )
	DynamicBrakeHasAutoBailOff ( 0 )
	BrakesEngineBrakeType ( Air_single_pipe )
	BrakesTrainBrakeType ( Air_single_pipe )
	BrakesEngineControllers ( "Train,Independent,Dynamic" )
	DoesHornTriggerBell ( 0 )

	EmergencyStopMonitor (
		MonitoringDeviceMonitorTimeLimit ( 0 )
		MonitoringDeviceAlarmTimeLimit ( 0 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 0 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 0 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 0 )
	)

	EngineControllers (
		AWS ( 0 1 0 )
		BailOffButton ( 0 1 0 )
		BellToggle ( 0 1 0 )
		Brake_Dynamic ( 0 1 0.166 0
			NumNotches ( 7
				Notch ( 0 0 Dummy )
				Notch ( 0.166 0 Dummy )
				Notch ( 0.33 0 Dummy )
				Notch ( 0.5 0 Dummy )
				Notch ( 0.67 0 Dummy )
				Notch ( 0.846 0 Dummy )
				Notch ( 0.999 0 Dummy )
			)
		)
		Brake_Engine ( 0 1 1 0
			NumNotches ( 2
				Notch ( 0 1 EngineBrakesControllerReleaseStart )
				Notch ( 1 1 EngineBrakesControllerApplyStart )
			)
		)
		Brake_Train ( 0 1 0.2 0
			NumNotches ( 4
				Notch ( 0 1 TrainBrakesControllerReleaseStart )
				Notch ( 0.4 0 TrainBrakesControllerGraduatedSelfLapLimitedStart )
				Notch ( 0.6 0 TrainBrakesControllerSuppressionStart )
				Notch ( 0.95 0 TrainBrakesControllerContinuousServiceStart )
			)
		)
		Throttle ( 0 1 0.166 0
			NumNotches ( 6
				Notch ( 0 0 Dummy )
				Notch ( 0.166 0 Dummy )
				Notch ( 0.33 0 Dummy )
				Notch ( 0.583 0 Dummy )
				Notch ( 0.75 0 Dummy )
				Notch ( 1 0 Dummy )
			)
		)
		Combined_Control ( 0 1 0.53 0.53 throttle train )
		DirControl ( -1 0 1 1 )
		EmergencyStopToggle ( 0 1 0 )
		Headlights ( 0 0.25 1 1 )
		Horn ( 0 1 0 )
		PantographToggle1 ( 0 1 1 )
		Sanding ( 0 1 0 )
		Vigilance ( 0 1 0 )
		Wipers ( 0 1 0 )
	)

	Name ( "Duewag Koeln 3764-C-Sonderzug" )
	Description (
		" Dieses Teil ist das Heckteil des Düwag \nBitte Kuppeln Sie dieses Teil mit einem a und b - Teil"
	)
	EngineOperatingProcedures (
		"Bitte Kuppeln Sie dieses Teil mit einem a und b - Teil"
	)
)
